{"initial_submission":{"name":"CSAT on Ticket","item_type":"snapin","description":"![CSAT on Ticket](https://devrev.ai/marketplace/api/item-artifact/don%3Acore%3Advrv-us-1%3Adevo%2F0%3Aartifact%2F8517)\n\n## Overview\n\nThe CSAT on Ticket snap-in offers a simplified approach to measure customer satisfaction level for the ticket resolution. Valuable feedback from these surveys can be utilised to enhance the overall customer experience.\n\n## Features\n\n### Customized questions and response message\nDuring the installation of snap-in, the survey question that will be populated when the survey scale is displayed to the customer can be customized as per your requirements. Similarly, the survey response message to be displayed to the customer after they submit the survey can also be customized.\n### Simple survey response scale\nA simple built-in five-point survey response scale encourages higher customer response rate. Build better understanding of the customer satisfaction level with the ticket with higher number of responses. While the scale remains constant, the text to be displayed on the button can be customized as per your requirements.\n\n## Installation\n\nTo enable CSAT, go to the DevRev Marketplace and select the **CSAT on Ticket** snap-in. In DevRev, go to the **Configuration** tab on the snap-in. Specify the configurations as per your requirement to convey your brand identity. Save the configuration and click **Next** to deploy the snap-in your environment.\n","tagline":"Capture customer satisfaction level","summary":"The CSAT on Ticket snap-in offers a simplified approach to measure customer satisfaction level with ticket resolution. Valuable feedback from these surveys can be utilised to enhance the overall customer experience.","icon_artifact":"don:core:dvrv-us-1:devo/0:artifact/8516","categories":["don:integration:dvrv-us-1:devo/0:marketplace/adcb26c3-7312-4920-8ad0-1947cd20c00a:marketplace_category/b94680a5-a1c7-4c2a-a8b8-1a95d2abb255"],"marketplace":"don:integration:dvrv-us-1:devo/0:marketplace/adcb26c3-7312-4920-8ad0-1947cd20c00a","snap_in_version":"don:integration:dvrv-us-1:devo/0:snap_in_package/6008e26a-b549-4f97-b0e8-aaeef5135721:snap_in_version/a7849012-5395-462b-8470-330fda8a98ef"}}